Repository: OmegaT-L10N/ca
Catalog: omegat/project_save.tmx
Source language: en
Languages: ca

source: ( OmegaT and OmegaT SL Localization in the example used here)
ca: ( OmegaT i OmegaT SL Localization en l'exemple utilitzat aquí)

source: - comparative, nominative, masculine, feminine, neutral, resp. Plural form of the adjective
ca: - comparatiu, nominatiu, masculí, femení, neutre, que corresponen a la forma plural de l'adjectiu

source: 1. Generalities
ca: 1. Generalitats

source: 1. Introduction
ca: 1. Introducció

source: 1. Version control - introduction
ca: 1. Control de Versió - introducció

source: 2.1. Creating a repository
ca: 2.1. Creació d'un repositori

source: 2.2. Importing the project to SVN repository - Windows
ca: 2.2. Importació del projecte al repositori SVN - Windows

source: 2. Languages selection
ca: 2. Selecció de llengües

source: 2. Public and private collections
ca: 2. Col·leccions públiques i privades

source: 2. Sharing a project using SVN
ca: 2. Compartir un projecte usant SVN

source: 3. Accessing the TaaS service
ca: 3. Accés al servei de TaaS

source: 3. Using the team project in OmegaT
ca: 3. Utilització del projecte en equip en OmegaT

source: Prev
ca: Anterior

source: Browse TaaS Collections will allow browsing existing collections for the source and target languages of the project, and downloading them.
ca: Browse TaaS Collections permetran navegar per les col·leccions existents per als idiomes d'origen i de destinació del projecte, i descarregar-les.

source: TaaS Terminology Lookup: when checked, will allow querying TaaS data on a segment by segment basis.
ca: TaaS Terminology Lookup: quan es comprovi, permetrà la consulta de les dades TaaS d'un segment a través d'una base segmentada.

source: VCS client: To interface with the server an SVN or Git client must be installed on computers of "project managers" involved in the OmegaT project.
ca: Client VCS: per interactuar amb el servidor, un client SVN o Git ha d'instal·lar-se en els ordinadors dels "caps de projecte" que participen en el projecte OmegaT.

source: VCS server - i.e. SVN or Git server is the environment where the common material is kept and maintained on the net.
ca: VSC server: el servidor SVN o Git és lloc a la xarxa on es guarda i es conserva el material comú.

source: add the copied files to the local version of the repository: right-click on the local checkout folder and select TortoiseSVN > Add. In the dialog that opens, leave all options as per default and click OK.
ca: Afegir els arxius copiats a la versió local del repositori: feu clic dret a la carpeta checkout i seleccioneu TortoiseSVN > Add. Al diàleg que s'obrirà, deixeu totes les opcions per defecte i feu clic a OK.

source: administrator: the person responsible for the creation and maintaining of the repository, i.e. taking care of the server side of the task.
ca: Administrador: la persona responsable de la creació i el manteniment del repositori, és a dir, tenir cura del costat del servidor de la tasca.

source: checkout: the operation that creates a working copy from the repository to your local computer.
ca: checkout: l'operació que crea una còpia de treball del repositori en l'equip local.

source: commit local changes to the server: right-click on the local checkout folder and select SVN Commit.... The Commit window - see below opens.
ca: Confirmar els canvis locals al servidor: feu clic dret a la carpeta checkout local i seleccioneu SVN Commit.... La finestra de confirmació, que apareix més avall s'obrirà.

source: repository: the place where the shared material is saved and maintained, either on a local access network or in Internet.
ca: Repositori: el lloc on es guarda i es conserva el material compartit, ja sigui en una xarxa d'accés local o a Internet.

source: update local files from the local repository copy - the changes received from the server repository reside within the .svn subfolder but not yet in the files and folders themselves.
ca: Actualitzeu els arxius locals des de la còpia local del repositori - els canvis rebuts del repositori del servidor resideixen a la subcarpeta .svn però els arxius i les carpetes encara no ho fan.

source: user: a member of the team, collaborating on the common project.
ca: Usuari: un membre de l'equip, el qual col·labora en el projecte comú.

source: A stemmer for English, for example, should identify the string "cats" (and possibly "catlike", "catty" etc.) as based on the root "cat", and "stemmer", "stemming", "stemmed" as based on "stem".
ca: Un lematitzador en anglès, per exemple, hauria d'identificar la sèrie "cats" (i possiblement també "catlike", "catty" etc.) basant-se en l'arrel "cat", i "stemmer", "stemming", "stemmed" basant-se en "stem".

source: A stemming algorithm reduces the words "fishing", "fished", "fish", and "fisher" to the root word, "fish".
ca: Un algorisme lematitzador redueix paraules com "fishing", "fished", "fish", i "fisher" a l'arrel de la paraula, és a dir, "fish".

source: Accessing the TaaS service
ca: Accés al servei de TaaS

source: After copying the required files into the checkout folder you will notice that its icon has changed: the green OK badge has changed to a red exclamation sign, signifying the change in the local copy of the repository.
ca: Després de copiar els arxius necessaris a la carpeta checkout s'adonarà que la seva icona ha canviat: la insígnia OK verda ha canviat a un signe d'exclamació vermell, la qual cosa significa el canvi en la còpia local del repositori.

source: All collections (public and private) will be queried for the source and target language.
ca: Totes les col·leccions (públiques i privades) es poden consultar en l'idioma d'origen i en el de destinació.

source: Also ignored_words.txt and learned_words.txt in the omegat folder may be worth sharing and maintaining on the team level.
ca: A més, també seria recomanable compartir i guardar a nivell d'equip ignored_words.txt (paraules ignorades) i learned_words.txt (paraules apreses) en la carpeta omegat.

source: Alternatively, to avoid this issue you can set a private SVN server, for example if you already have an Apache server that includes the software in question (e.g. VisualSVN).
ca: Alternativament, per evitar aquest problema podeu establir un servidor SVN privat, per exemple, si ja teniu un servidor Apache que inclou el programari en qüestió (p. e. VisualSVN).

source: Appendix B. Keyboard shortcuts in the editor
ca: Apèndix B. Dreceres de teclat en l'editor

source: Appendix C. OmegaT Team Projects
ca: Apèndix C. Projectes en Equip OmegaT

source: Appendix D. Tokenizers
ca: Apèndix D. Tokenizers

source: Appendix E. LanguageTool plugin
ca: Apèndix E. Connector LanguageTool

source: Avoid in any case adding bak files, project_stats.txt and project_stats_match.txt, in the omegat subfolder, as they would without any need or profit just bloat the repository.
ca: Eviteu en qualsevol cas afegir arxius bak , project_stats.txt i project_stats_match.txt en la subcarpeta omegat, ja que, si no són necessàries o d'utilitat, simplement inflaran el repositori.

source: Borrowing an example from Slovenian, here "good" in all possible grammatically correct forms:
ca: Prenent un exemple de l'eslovè, trobem l'adjectiu "bo" en totes les formes possibles gramaticalment correctes:

source: Chapter 19. Glossaries
ca: Capítol 19. Glossaris

source: Chapter 20. Using TaaS in OmegaT
ca: Capítol 20. Utilització de TaaS en OmegaT

source: Chapter 21. Machine Translation
ca: Capítol 21. Traducció automàtica

source: Check the changes to be made - i.e. the folders and files added in this case.
ca: Comproveu els canvis que cal realitzar, és a dir, en aquest cas les carpetes i els arxius afegits.

source: Check the contents of the folder to confirm that the local copy of the repository and the corresponding files and folders correspond to the latest server version:
ca: Comproveu el contingut de la carpeta per confirmar que la còpia local del repositori i els arxius i les carpetes corresponents corresponen a l'última versió del servidor:

source: Choose SVN.
ca: Trieu SVN.

source: Click Create Project
ca: Feu clic aCreate Project (Crear projecte)

source: Click on Options, Glossary to display the following options:
ca: Feu clic a Opcions, Glossari per mostrar les següents opcions:

source: Conflicts - for instance alternative translations of the same segment or glossary entry - can be monitored, resolved and merged
ca: Els conflictes - com, per exemple, traduccions alternatives d'un mateix segment o d'una entrada del glossari - poden ser monitoritzats, resolts i fusionats.

source: Create a new project on ProjectLocker
ca: Creeu un nou projecte en ProjectLocker

source: Create an empty folder, where you will keep your project and right-click on it.
ca: Creeu una carpeta buida, on es guardarà el vostre projecte i feu clic.

source: Creating a repository
ca: Creació d'un repositori

source: Credentials are stored, so it isn't needed to enter them each time.
ca: Les credencials s'emmagatzemen, per la qual cosa no serà necessari per inserir-les cada vegada.

source: Enter an appropriate message into the message window and press OK.
ca: Introduïu el missatge corresponent a la finestra de missatge i premeu OK

source: Enter the URL, provided by ProjectLocker, into the field URL of repository.
ca: Escriviu la URL proporcionada per ProjectLocker, en el campURL of repository (URL del repositori).

source: Every three minutes by default, an updated version of data shared is available to the rest of the team
ca: Per defecte, cada tres minuts una versió actualitzada de les dades compartides estarà disponible per a la resta de l'equip.

source: First, they need to use Project > Download Team Project.
ca: En primer lloc, han de prémer Projecte> Baixa un projecte en equip.

source: For Mac you can download the client for instance from SourceForge, For Linux see Subversion Commands and Scripts.
ca: Per a Mac podeu descarregar el client de, per exemple, SourceForge</a>, per a Linux veure Subversion Commands and Sripts</a>.

source: For Windows we recommend TortoiseSVN.
ca: Per a Windows recomanem TortoiseSVN.

source: For subsequent use, all is needed is opening the project like any other OmegaT project.
ca: Per als usos posteriors, tot el que es necessita és obrir el projecte com qualsevol altre projecte OmegaT.

source: For the example shown here we decided for the one OmegaT project - one single repository for the simplicity reasons.
ca: Per l'exemple que es mostra aquí ens vam decidir per un projecte OmegaT - un únic repositori per raons de simplicitat.

source: Generalities
ca: Generalitats

source: Go to https://demo.taas-project.eu/account/keys/create?system=omegaT to create your own key then give it to OmegaT with -Dtaas.user.key=xxxxx (TAAS_API_KEY_NOT_FOUND)
ca: Aneu a https://demo.taas-project.eu/account/keys/create?system=omegaT per crear la vostra pròpia clau i després introduïu-la a OmegaT a través de -Dtaas.user.key = xxxxx (TAAS_API_KEY_NOT_FOUND)

source: Home
ca: Inici

source: Importing the project to SVN repository - Windows
ca: Importació del projecte al repositori SVN - Windows

source: In case no tokenizer exists for the current languages, OmegaT uses Hunspell instead (in that case, make sure that relevant Hunspell dictionaries are installed).
ca: En cas que no hi hagi un tokenizer per a les llengües emprades, OmegaT utilitza en lloc Hunspell (en aquest cas, assegureu-vos que els diccionaris Hunspell pertinents estan instal·lats).

source: In that dialog, it's possible to select All domains or a specific one.
ca: En aquest diàleg, és possible seleccionar tots els dominis o un d'específic.

source: In the next step, we will add the OmegaT files to the local folder.
ca: En el següent pas, afegirem els arxius OmegaT a la carpeta local.

source: Incompatibilities
ca: Incompatibilitats

source: Introduction
ca: Introducció

source: It allows accessing both public and private data, where private glossaries (called "collections") can be extracted from existing documents, and the target terms partly populated automatically from various sources.
ca: Permet accedir tant a dades públiques com a privades, on glossaris privats (anomenats "col·leccions") es poden extreure dels documents existents i els termes de la llengua de destinació es poden ingressar parcialment de manera automàtica des de diverses fonts.

source: It is possible to select another tokenizer (Language Tokenizer) or a different version of the tokenizer (Tokenizer Behavior) from the Project Properties window.
ca: És possible seleccionar un altre tokenizer (Language Tokenizer) o una versió diferent (Tokenizer Behavior) des de la finestra Propietats del projecte.

source: It will first commit the current contents to the server repository and then update the local copy of the repository - i.e. the contents of .svn subfolder - so that it is up to date with the latest repository version.
ca: Serà primer cometre els continguts actuals al repositori del servidor i després actualitzar la còpia local del repositori - és a dir, el contingut de subcarpeta .svn - de manera que està al dia amb l'última versió del repositori.

source: Languages selection
ca: Selecció de llengües

source: Make sure the field Checkout directory is correct, i.e. specifies the empty folder you have created, and press OK.
ca: Assegureu-vos que el camp Checkout directory és correcte, és a dir, que especifica la carpeta buida que heu creat, i premeu OK.

source: Navigation footer
ca: Peu de pàgina de navegació

source: Navigation header
ca: Capçalera de navegació

source: Next
ca: Següent

source: Note that the creator of the repository has implicitly the administrator rights for the repository created.
ca: Recordeu que el creador del repositori té implícitament els drets d'administrador per al repositori creat.

source: Note that the team members have to be registered first, before you can add them to the project (Note: in the free version of ProjectLocker you are allowed only two users per project).
ca: Recordeu que els membres de l'equip han d'estar registrats, abans de poder afegir-los al projecte (Nota: en la versió gratuïta de ProjectLocker només es permeten dos usuaris per projecte).

source: OmegaT 3.1 - User's Guide
ca: OmegaT 3.1 - Manual de l'usuari

source: OmegaT allows accessing the public part of TaaS without any registration.
ca: OmegaT permet l'accés a la part pública de TaaS sense cap tipus de registre.

source: OmegaT automatically selects a tokenizer for the source and the target language according to the language settings of the project.
ca: OmegaT selecciona automàticament un tokenizer per a la llengua d'origen i per a la de destinació d'acord amb la configuració de llengua del projecte.

source: OmegaT configuration launchers (OmegaT.l4J.ini, omegat.kaptn and OmegaT.sh) contain a template entry.
ca: La configuració de les interfícies d'inici d'OmegaT (OmegaT.l4J.ini, omegat.kaptn and OmegaT.sh) contenen un model d'entrada.

source: OmegaT supports two of the popular version control systems (VCS for short), Apache Subversion (often abbreviated SVN, after the command name svn) and Git.
ca: OmegaT dóna suport a dos populars sistemes de control de versions (VCS per abreujar), Apache Subversion (sovint abreujat SVN, degut al nom de la comanda svn) i Git.

source: OmegaT will not launch if tokenizers are found in the /plugin folder.
ca: OmegaT no s'iniciarà si els tokenizers es troben a la carpeta / plugins.

source: OmegaT will recognize it is a team project, and will synchronize everything automatically, every three minutes by default.
ca: OmegaT reconeixerà que és un projecte d'equip, i sincronitzarà, per defecte, tots els elements automàticament cada tres minuts.

source: Once the SVN server is available, project managers must locally install a SVN client, in order to manage the project contents on their computers.
ca: Una vegada el servidor SVN està disponible, els administradors del projecte hauran d'instal·lar localment un client SVN, per tal d'administrar el contingut del projecte en els seus equips.

source: Once the operation has finished, you can check the said folder: it should now contain a subfolder .svn and a green OK badge on its icon will show, that the contents of the folder are up-to-date:
ca: Una vegada hagi acabat aquesta operació, podeu comprovar la susdita carpeta: aquesta hauria de contenir ara una subcarpeta .svn i, si hi ha una insígnia OK verda a la icona d'aquesta, voldrà dir que els continguts de la subcarpeta estan actualitzats:

source: Once the team project is setup, team members only need OmegaT to access the team project.
ca: Una vegada configurat el projecte, els membres de l'equip sols necessiten OmegaT per accedir al projecte en equip.

source: One member of the team, the project administrator, needs to be acquainted with handling the server side, i.e. the job of setting up the environment, importing the OmegaT project, assigning the access rights for the team members, resolving the conflicts, etc.
ca: Un dels membres de l'equip, l'administrador del projecte, ha d'estar familiaritzat amb el maneig del costat del servidor: el treball de la configuració de l'entorn, la importació del projecte OmegaT, l'assignació dels drets d'accés per als membres de l'equip, la resolució dels conflictes, etc.

source: Open the Projects view for your account.
ca: Obriu la vista Projects (Projectes) del vostre compte.

source: Other operating systems (Linux, OS X) offer similar packages.
ca: Altres sistemes operatius (Linux, OS X) ofereixen paquets similars.

source: Private collections are displayed in bold.
ca: Les col·leccions privades es mostraran en negreta.

source: Project members connect with it via their VCS client.
ca: Els membres del projecte es connecten a aquest a través del seu client VCS.

source: Projects can be managed according to your development style and needs.
ca: Els projectes poden ser gestionats d'acord al vostre estil i necessitats de desenvolupament.

source: Public and private collections
ca: 2. Col·leccions públiques i privades

source: Remove all the tokenizers from the /plugin folder before starting OmegaT.
ca: Traieu tots els tokenizers de la carpeta / plugins abans d'iniciar OmegaT.

source: Select TortoiseSVN > Checkout. The following dialog appears:
ca: Seleccioneu TortoiseSVN > Checkout. i apareixerà el següent diàleg:

source: Several team members can work on the translation project simultaneously without interfering with each other
ca: Diversos membres de l'equip poden treballar en el projecte de traducció simultàniament sense interferir entre si.

source: Sharing a project using SVN
ca: Compartir un projecte utilitzant SVN

source: Sign in to the site first or - if it is your first time on the site, register for it and note your user name and password for the future projects.
ca: Inicieu sessió primer en la pàgina o - si hi és la primera vegada, registreu-s'hi i anoteu el vostre nom d'usuari i la contrasenya per a pròxims projectes.

source: Similar as in the case of OmegaT projects, you will need to have separate repositories for different language pairs.
ca: De la mateixa manera que en el cas dels projectes d'OmegaT, es necessitaran repositoris separats per a diferents parells d'idiomes.

source: The Add Finished!
ca: El procés d'afegiment ha finalitzat!

source: The Commit window will open and show the progress of the commit command.
ca: La finestra de confirmació s'obrirà i mostrarà el progrés de la comanda de confirmació.

source: The TaaS service at https://demo.taas-project.eu/info provides terminology services in European languages (plus Russian).
ca: El servei de TaaS en https://demo.taas-project.eu/info ofereix serveis de terminologia en les llengües europees (a més d'en rus).

source: The URL shown under Project Services will be used by SVN to connect clients to the SVN server you have just established.
ca: La URL que apareix baix de Project Services (Serveis de projecte) serà utilitzada pel servidor SVN per connectar els clients al servidor SVN que acabeu d'establir.

source: The administrator may decide to include following folders and their contents as well: tm, glossary and dictionary.
ca: L'admistrador pot incloure les següents carpetes, així com el seu contingut: tm, glossary i dictionary

source: The advantages of a VC system for a team of translators can be summarized as follows:
ca: Els avantatges d'un sistema de control de versions per a un equip de traductors es poden resumir de la següent manera:

source: The alternative is to have one single repository with subfolders Project1, Project2, etc., and share the common material via common tm, glossary and dictionary folders.
ca: L'alternativa és tenir un únic repositori amb subcarpetes Project1, Project2, etc., i compartir el material comú a través de carpetes de tm, glossary i dictionary comunes.

source: The collaborative translation offered by OmegaT is based on the functionality of version or revision control, widely used by the software community to maintain control of changes to the code of a program and allow unimpeded collaboration within the development team.
ca: La traducció col·laborativa oferida per OmegaT es basa en la funcionalitat d'un control de versions o revisions, àmpliament utilitzada per la comunitat de programari per mantenir el control de canvis en el codi d'un programa i permetre la col·laboració sense traves dins l'equip de desenvolupament.

source: The collections are downloaded as TBX glossaries in the current glossary folder.
ca: Les col·leccions es descarreguen com a glossaris TBX a la carpeta glossari que s'estigueu utilitzant.

source: The contents of the checkout folder will be marked accordingly:
ca: Els contiguts de la carpeta checkout es marcaran en conseqüència:

source: The following files are to be shared among the members of the team and thus have to be included in any case:
ca: Els següents arxius es compartiran entre els membres de l'equip i, per tant, han d'estar inclosos en tot cas:

source: The following terms, to be used in the text below, deserve a short explanation:
ca: Els següents termes, que s'utilitzaran en el text més endavant, mereixen una breu explicació:

source: The following two steps will bring the server version up to date:
ca: Els dos passos següents actualitzaran la versió del servidor:

source: The key must then be given to OmegaT using -Dtaas.user.key=xxxxx.
ca: Llavors, la clau haurà de ser introduïda a OmegaT a través de = -Dtaas.user.key xxxxx.

source: The procedure presented here relies on the free SVN server (limited to 2 users) offered by ProjectLocker.
ca: El procediment que aquí es presenta es basa en el servidor SVN lliure (limitat a 2 usuaris) oferit per ProjectLocker.

source: The repository is empty at this moment.
ca: El repositori estarà buit en aquest moment.

source: The server can exist in the local network but in the majority of cases it will be available on internet, i.e. via URL address.
ca: El servidor pot existir a la xarxa local, però en la majoria dels casos està disponible a Internet a través d'una adreça URL.

source: The server keeps the information on checkouts, so that later commits (see below) can be performed in an orderly fashion.
ca: El servidor conserva la informació en checkouts, de manera més tard es poden dur a terme commits (veure més avall) d'una manera ordenada.

source: The server makes sure that any conflicting changes, due to two members working on the same checked-out contents, will be resolved.
ca: El servidor assegura que qualsevol canvi conflictiu, a causa de què dos membres que treballen en els mateixos continguts checked-out, es resoldran.

source: The system maintains versioning for data shared
ca: El sistema manté el control de versions en les dades compartides.
